; domain
(define (domain robots)
  (:requirements :strips :typing)
  (:types robot hand person
          room cupholder tea-machine)
  (:predicates
    (room-adjacent ?r1 ?r2 - room)
    (allowed-room ?rob - robot ?r - room)
    (at ?i - (either robot person cupholder tea-machine) ?r - room)
    (empty ?h - hand ?rob - robot)
    (empty-cup ?h - hand ?rob - robot)
    (full-cup ?h - hand ?rob - robot)
    (served ?p - person)
  )

  (:action move-robot
    :parameters (?rob - robot ?r1 - room ?r2 - room)
    :precondition (and 
      (at ?rob ?r1)
      (room-adjacent ?r1 ?r2)
      (allowed-room ?rob ?r2)
    )
    :effect (and 
      (not (at ?rob ?r1))
      (at ?rob ?r2)
    )
  )

  (:action exchange-empty
    :parameters (?rob1 - robot ?rob2 - robot ?r - room ?h1 - hand ?h2 - hand)
    :precondition (and 
      (at ?rob1 ?r)
      (at ?rob2 ?r)
      (empty-cup ?h1 ?rob1)
      (empty ?h2 ?rob2)
    )
    :effect (and
      (not (empty-cup ?h1 ?rob1))
      (not (empty ?h2 ?rob2))
      (empty-cup ?h2 ?rob2)
      (empty ?h1 ?rob1)
    )
  )

  (:action exchange-full
    :parameters (?rob1 - robot ?rob2 - robot ?r - room ?h1 - hand ?h2 - hand)
    :precondition (and 
      (at ?rob1 ?r)
      (at ?rob2 ?r)
      (full-cup ?h1 ?rob1)
      (empty ?h2 ?rob2)
    )
    :effect (and
      (not (full-cup ?h1 ?rob1))
      (not (empty ?h2 ?rob2))
      (full-cup ?h2 ?rob2)
      (empty ?h1 ?rob1)
    )
  )

  (:action serve
    :parameters (?rob - robot ?p - person ?h - hand ?r - room)
    :precondition (and
      (at ?rob ?r)
      (at ?p ?r)
      (full-cup ?h ?rob)
    )
    :effect (and
      (served ?p)
      (not (full-cup ?h ?rob))
      (empty-cup ?h ?rob)
    )
  )

  (:action pick-empty-cup
    :parameters (?rob - robot ?r - room ?h - hand ?cp - cupholder)
    :precondition (and 
      (at ?rob ?r)
      (at ?cp ?r)
      (empty ?h ?rob)
    )
    :effect (and
      (not (empty ?h ?rob))
      (empty-cup ?h ?rob)
    )
  )

  (:action fulfill-cup
    :parameters (?rob - robot ?r - room ?h - hand ?tm - tea-machine)
    :precondition (and 
      (at ?rob ?r)
      (at ?tm ?r)
      (empty-cup ?h ?rob)
    )
    :effect (and
      (not (empty-cup ?h ?rob))
      (full-cup ?h ?rob)
    )
  )
)

; problem
(define (problem probrobots)
    (:domain robots)
    (:objects
        P1 P2 - person
        ROB1 ROB2 - robot
        HL HR - hand
        PAS R1 R2 R3 R4 - room
        TM - tea-machine
        CH - cupholder
    )
    (:init
        (room-adjacent PAS R1) (room-adjacent R1 PAS)
        (room-adjacent PAS R2) (room-adjacent R2 PAS)
        (room-adjacent PAS R3) (room-adjacent R3 PAS)
        (room-adjacent PAS R4) (room-adjacent R4 PAS)
        (room-adjacent R1 R2) (room-adjacent R2 R1)
        (room-adjacent R3 R4) (room-adjacent R4 R3)

        (allowed-room ROB1 PAS)
        (allowed-room ROB1 R1)
        (allowed-room ROB1 R2)

        (allowed-room ROB2 PAS)
        (allowed-room ROB2 R3)
        (allowed-room ROB2 R4)

        (at ROB1 R1) (at ROB2 R3)
        (at P1 R2) (at P2 R3)

        (at TM R1) (at CH R3)

        (empty HL ROB1) (empty HR ROB1)
        (empty HL ROB2) (empty HR ROB2)
    )
    (:goal
        (and 
            (served P1)
            (served P2)
        )
    )
)

; plan
1. (pick-empty-cup rob2 r3 hl ch)
   deleted: (empty hl rob2)
   added: (empty-cup hl rob2)
   goals met: 0 of 2
2. (move-robot rob1 r1 pas)
   deleted: (at rob1 r1)
   added: (at rob1 pas)
   goals met: 0 of 2
3. (move-robot rob2 r3 pas)
   deleted: (at rob2 r3)
   added: (at rob2 pas)
   goals met: 0 of 2
4. (exchange-empty rob2 rob1 pas hl hr)
   deleted: (empty-cup hl rob2) (empty hr rob1)
   added: (empty-cup hr rob1) (empty hl rob2)
   goals met: 0 of 2
5. (move-robot rob1 pas r1)
   deleted: (at rob1 pas)
   added: (at rob1 r1)
   goals met: 0 of 2
6. (fulfill-cup rob1 r1 hr tm)
   deleted: (empty-cup hr rob1)
   added: (full-cup hr rob1)
   goals met: 0 of 2
7. (move-robot rob1 r1 r2)
   deleted: (at rob1 r1)
   added: (at rob1 r2)
   goals met: 0 of 2
8. (serve rob1 p1 hr r2)
   deleted: (full-cup hr rob1)
   added: (served p1) (empty-cup hr rob1)
   goals met: 1 of 2
9. (move-robot rob1 r2 r1)
   deleted: (at rob1 r2)
   added: (at rob1 r1)
   goals met: 1 of 2
10. (fulfill-cup rob1 r1 hr tm)
   deleted: (empty-cup hr rob1)
   added: (full-cup hr rob1)
   goals met: 1 of 2
11. (move-robot rob1 r1 pas)
   deleted: (at rob1 r1)
   added: (at rob1 pas)
   goals met: 1 of 2
12. (exchange-full rob1 rob2 pas hr hl)
   deleted: (full-cup hr rob1) (empty hl rob2)
   added: (full-cup hl rob2) (empty hr rob1)
   goals met: 1 of 2
13. (move-robot rob2 pas r3)
   deleted: (at rob2 pas)
   added: (at rob2 r3)
   goals met: 1 of 2
14. (serve rob2 p2 hl r3)
   deleted: (full-cup hl rob2)
   added: (served p2) (empty-cup hl rob2)
   goals met: 2 of 2
